package org.bodyrevamp.orsc

import org.bodyrevamp.orsc.trainings.TrainingListItem


val TRAININGS = arrayListOf(
    TrainingListItem(
        title = "В рамках одной тренировки",
        plan = " Тяжёлый присед на 2–6 повторений, жим гантелей и отжимания на брусьях на 6–12 повторов, а также разводку гантелей на 15–20 повторений.",
        aim = "Повышение силовых",
        time = "2:00 ч"
    ),
    TrainingListItem(
        title = "По сплитам",
        plan = "Один день работать на силу верхней части тела (2–6 повторений с 85‑95% от 1ПМ), второй день — на силу нижней части, третий день — на объём верхней (8–12 повторений с 75–85% от 1ПМ), четвёртый — на объём нижней.",
        aim = "Повышение выносливости",
        time = "1:30 ч"
    ),
    TrainingListItem(
        title = "По тренировочным циклам",
        plan = "2–4 недели работать на силу (2–6 повторений), следующие 2–4 недели — на объём мышц (8–12 повторов), и 2–4 недели — на выносливость (15 и больше повторений).",
        aim = "На объем мышц",
        time = "1:45 ч"
    ),
)